In [2]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
# :NOTE here i create that df what Reuven M. Lerner. used 

df = DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500,
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
                {'product_id':24, 'name':'phone', 'wholesale_price': 200,
                 'retail_price':500, 'sales':100},
                {'product_id':16, 'name':'apple', 'wholesale_price': 0.5,
                 'retail_price':1, 'sales':200},
                {'product_id':17, 'name':'pear', 'wholesale_price': 0.6,
                 'retail_price':1.2, 'sales':75}
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0        1000.0    100
1          96  Python Workout             35.0          75.0   1000
2          97  Pandas Workout             35.0          75.0    500
3          15          banana              0.5           1.0    200
4          87        sandwich              3.0           5.0    300
5          24           phone            200.0         500.0    100
6          16           apple              0.5           1.0    200
7          17            pear              0.6           1.2     75

In [4]:
df.loc[df['sales'] > df['sales'].mean(), ['product_id', 'name']]

   product_id            name
1          96  Python Workout
2          97  Pandas Workout

In [5]:
df.query('sales > sales.mean()')[['product_id', 'name']]

   product_id            name
1          96  Python Workout
2          97  Pandas Workout

### Beyond the exercise_1
##### In each case, practice using both loc and query:

In [6]:
df['current_net_revenue'] = (df['retail_price'] - df['wholesale_price']) * df['sales']
df

   product_id            name  ...  sales  current_net_revenue
0          23        computer  ...    100              50000.0
1          96  Python Workout  ...   1000              40000.0
2          97  Pandas Workout  ...    500              20000.0
3          15          banana  ...    200                100.0
4          87        sandwich  ...    300                600.0
5          24           phone  ...    100              30000.0
6          16           apple  ...    200                100.0
7          17            pear  ...     75                 45.0

[8 rows x 6 columns]

In [7]:
# Show the ID and name of products whose net income is in the top 25% quantile.

df.query('current_net_revenue >= current_net_revenue.quantile(0.75)')[['product_id', 'name']]

   product_id            name
0          23        computer
1          96  Python Workout

In [8]:
df.loc[df['current_net_revenue'] >= df['current_net_revenue'].quantile(0.75), ['product_id', 'name']]

   product_id            name
0          23        computer
1          96  Python Workout

### Beyond the exercise_2

In [9]:
# Show the ID and name of products with lower-than-average sales numbers and
# whose wholesale price is greater than the average.

df.query('(sales < sales.mean()) & (wholesale_price > wholesale_price.mean())')[['product_id', 'name']]

   product_id      name
0          23  computer
5          24     phone

In [10]:
df.loc[(df['sales'] < df['sales'].mean()) & (df['wholesale_price'] > df['wholesale_price'].mean()), ['product_id', 'name']]

   product_id      name
0          23  computer
5          24     phone

### Beyond the exercise_3

In [14]:
# Show the name and wholesale and retail prices of products with IDs between 80
# and 100 and that sold fewer than 400 units.

df.query('(product_id > 80) & (product_id < 100) & (sales < 400)')[['name', 'wholesale_price', 'retail_price']]

       name  wholesale_price  retail_price
4  sandwich              3.0           5.0

In [17]:
df.loc[(df['product_id'] > 80) & (df['product_id'] < 100) & (df['sales'] < 400), ['name', 'wholesale_price', 'retail_price']]

       name  wholesale_price  retail_price
4  sandwich              3.0           5.0